Repository: rmraya/XLIFFManager
Catalog: XliffManager_docs.tmx
Source language: en
Languages: es

source: Translation Tasks
es: Traducciones

source: Use the options in the Translation Tasks panel to:
es: Utilice las opciones del panel Traducciones para:

source: Copy Source to all Untranslated Segments
es: Copiar origen a destino en todos los segmentos no traducidos

source: Pseudo-Translate Untranslated Segments
es: Pseudo-traducir segmentos no traducidos

source: Remove all Targets
es: Eliminar todas las traducciones

source: Approve all Segments
es: Aprobar todos los segmentos

source: Supported File Formats
es: Tipos de Archivo Compatibles

source: With XLIFF Manager you can create XLIFF files from the following document formats:
es: Con XLIFF Manager puede crear archivos XLIFF a partir de los siguientes tipos de documentos:

source: General Documentation
es: Documentación General

source: Software Development
es: Desarrollo de Software

source: Adobe InDesign IDML CS4, CS5, CS6 & CC
es: Adobe InDesign IDML CS4, CS5, CS6 y CC

source: Plain Text
es: Texto sin Formato

source: Trados Studio Packages
es: Paquetes de Trados Studio

source: SRT Subtitles
es: Subtítulos SRT

source: Wordfast/GlobalLink TXML (*.txml)
es: TXML de Wordfast/GlobalLink (*.txml)

source: Wordfast/GlobalLink XLIFF (*.txlf)
es: XLIFF de Wordfast/GlobalLink (*.txlf)

source: WPML XLIFF (WordPress Multilingual Plugin)
es: XLIFF de WPML (WordPress Multilingual Plugin)

source: XLIFF from Other Tools (*.mqxliff, *.xliff)
es: XLIFF de otras herramientas (*.mqxliff, *.xliff)

source: XML (Generic)
es: XML (Genérico)

source: XML with ready to use configuration files for:
es: XML con archivos de configuración listos para usar para:

source: DITA 1.0, 1.1, 1.2 and 1.3
es: DITA 1.0, 1.1, 1.2 y 1.3

source: DocBook 3.x, 4.x and 5.x
es: DocBook 3.x, 4.x y 5.x

source: Java Properties
es: Propiedades de Java

source: RC (Windows C/C++ Resources)
es: RC (Recursos de Windows C/C++)

source: ResX (Windows .NET Resources)
es: ResX (Recursos de Windows .NET)

source: TS (Qt Linguist Translation Source)
es: TS (Fuente de Traducción de Qt Linguist)

source: The filter for XML files supports custom configuration. Users can define conversion rules for almost any XML vocabulary. Instructions for configuring the XML filter are available in Swordfish's documentation.
es: El filtro para archivos XML admite la configuración personalizada. Los usuarios pueden definir reglas de conversión para casi cualquier vocabulario XML. Las instrucciones para configurar el filtro XML están disponibles en la documentación de Swordfish .

source: Introduction
es: Introducción

source: XLIFF Manager provides an open source UI for OpenXLIFF Filters , a set of programs that let you:
es: XLIFF Manager proporciona una interfaz de usuario de código abierto para OpenXLIFF Filters , un conjunto de programas que le permiten:

source: Create XLIFF 1.2 and 2.0 files that can be translated in any modern CAT tool.
es: Cree archivos XLIFF 1.2 y 2.0 que se pueden traducir en cualquier herramienta TAO moderna.

source: Convert your translated XLIFF files to original format with a couple of clicks.
es: Convertir sus archivos XLIFF traducidos al formato original con un par de clics.

source: Validate XLIFF files created by any tool. Validation is supported for XLIFF 1.0, 1.1, 1.2 and 2.0.
es: Validar archivos XLIFF creados por cualquier herramienta. La validación es compatible con XLIFF 1.0, 1.1, 1.2 y 2.0.

source: Produce an HTML file with word counts and segment status statistics from an XLIFF document.
es: Generar un archivo HTML con conteos de palabras y estadísticas de estado de segmentos a partir de un documento XLIFF.

source: Supported Platforms
es: Plataformas Compatibles

source: XLIFF Manager works on these platforms:
es: XLIFF Manager funciona en estas plataformas:

source: Microsoft Windows (8, 8.1, 10 and 11)
es: Microsoft Windows (8, 8.1, 10 y 11)

source: macOS High Sierra (10.13), Mojave (10.14), Catalina (10.15), Big Sur (11.0), Monterey (12.0) and Ventura (13.0)
es: macOS High Sierra (10.13), Mojave (10.14), Catalina (10.15), Big Sur (11.0), Monterey (12.0) y Ventura (13.0)

source: Linux (with GNOME Desktop Manager)
es: Linux (con GNOME Desktop Manager)

source: Computer Assisted Translation (CAT)
es: Traducción asistida por ordenador (TAO)

source: Computer technology application designed to assist human translators in the translation process.
es: Aplicación informática diseñada para ayudar a los traductores humanos en el proceso de traducción.

source: Segmentation Rules eXchange (SRX) is an XML-based standard that was maintained by Localization Industry Standards Association, until it became insolvent in 2011, and then by the Globalization and Localization Association (GALA).
es: Segmentation Rules eXchange (SRX) es un estándar basado en XML que fue mantenido por la Localization Industry Standards Association, hasta que se declaró insolvente en 2011, y luego por Globalization and Localization Association (GALA).

source: SRX provides a common way to describe how to segment text for translation and other language-related processes. It was created when it was realized that TMX was less useful than expected in certain instances due to differences in how tools segment text. SRX is intended to enhance the TMX standard so that translation memory (TM) data that is exchanged between applications can be used more effectively. Having the segmentation rules available that were used when a TM was created increases the usefulness of the TM data.
es: SRX proporciona una forma estandar de describir cómo segmentar texto para traducción y otros procesos relacionados con el lenguaje. Se creó cuando se hizo evidente que TMX era menos útil de lo esperado en ciertos casos debido a las diferencias en la forma en que las herramientas segmentan el texto. SRX está diseñado para mejorar el estándar TMX para que los datos de la memoria de traducción (TM) que se intercambian entre aplicaciones se puedan utilizar de manera más efectiva. Tener disponibles las reglas de segmentación que se usaron cuando se creó una TM aumenta la utilidad de los datos de TM.

source: Translation Memory eXchange (TMX) is an open standard originally published by LISA (Localization Industry Standards Association). The purpose of TMX is to allow easier exchange of translation memory data between tools and/or translation vendors with little or no loss of critical data during the process.
es: Translation Memory eXchange (TMX) es un estándar abierto publicado originalmente por LISA (Localization Industry Standards Association). El propósito de TMX es permitir un intercambio más fácil de datos de memorias de traducción entre herramientas y/o proveedores de traducción con poca o ninguna pérdida de datos críticos durante el proceso.

source: XLIFF (XML Localization Interchange File Format) is an open standard developed by OASIS (Organization for the Advancement of Structured Information Standards). The purpose of this vocabulary is to store localizable data and carry it from one step of the localization process to the other, while allowing interoperability between tools.
es: XLIFF (XML Localization Interchange File Format) es un estándar abierto desarrollado por OASIS (Organization for the Advancement of Structured Information Standards). El propósito de este vocabulario es almacenar datos localizables y llevarlos de un paso del proceso de localización a otro, al tiempo que permite la interoperabilidad entre herramientas.

source: Character Set
es: Juego de Caracteres

source: A character set (sometimes referred to as code page) is a collection of characters that are associated with a sequence of natural numbers in order to facilitate the storage of text in computers and the transmission of text through telecommunication networks.
es: Un juego de caracteres (a veces denominado página de códigos) es una colección de caracteres que están asociados con una secuencia de números naturales para facilitar el almacenamiento de texto en computadoras y la transmisión de texto a través de redes de telecomunicaciones.

source: Generate Word Counts and Segment Statistics
es: Generar Conteos de Palabras y Estadísticas de Segmentos

source: XLIFF Manager lets you produce an HTML file with word counts and segment status statistics from an XLIFF document.
es: XLIFF Manager le permite generar un archivo HTML con conteos de palabras y estadísticas de estado de segmentos a partir de un documento XLIFF .

source: Translation Status Analysis
es: Estado de la Traducción

source: On the left panel, click on the Analyse XLIFF option.
es: En el panel izquierdo, haga clic en la opción Analizar XLIFF .

source: Type the name and location of the XLIFF file to analyse in the XLIFF File text box or click the Browse... button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea analizar en el cuadro de texto Archivo XLIFF o haga clic en el botón Examinar... para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the Analyse XLIFF button.
es: Haga clic en el botón Analizar XLIFF .

source: XLIFF Manager generates an HTML report in the folder where the XLIFF file is located and its name is the name of the XLIFF plus .log.html .
es: XLIFF Manager genera un informe HTML en la carpeta donde se encuentra el archivo XLIFF y su nombre es el nombre del XLIFF mas .log.html .

source: Set approved="true" in all <trans-unit> elements in an XLIFF 1.2 file or set state="final" in all <unit> elements of an XLIFF 2.0 document.
es: Asignar approved="true" en todos los elementos <trans-unit> de un archivo XLIFF 1.2 o asignar state="final" en todos los elementos <unit> de un documento XLIFF 2.0.

source: Some translation tools do not offer a way to confirm segments at translation time. Use this feature to confirm all segments, so you can select the Export Approved Segments as TMX option when using the Merge XLIFF File option.
es: Algunas herramientas de traducción no ofrecen una forma de confirmar segmentos en el momento de la traducción. Utilice esta función para confirmar todos los segmentos, de modo que pueda seleccionar la opción Exportar segmentos aprobados como TMX cuando utilice la opción Combinar XLIFF .

source: On the left panel, click on the Translation Tasks option.
es: En el panel izquierdo, haga clic en la opción Traducciones .

source: Type the name and location of the XLIFF file to process in the XLIFF File text box or click the Browse... button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea procesar en el cuadro de texto Archivo XLIFF o haga clic en el botón Examinar... para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the Approve all Segments button.
es: Haga clic en el botón Aprobar Todos los Segmentos .

source: Copy the content of <source> elements to new or existing empty <target> elements in an XLIFF file.
es: Copiar el contenido de los elementos <source> a los elementos <target> que estén vacíos, creando nuevos elementos de ser necesario, en un archivo XLIFF.

source: Click the Copy Source to Target button.
es: Haga clic en el botón Copiar Origen a Destino .

source: Create XLIFF File
es: Crear Archivo XLIFF

source: Use the Create XLIFF panel to generate an XLIFF file from a selected document.
es: Utilice el panel Crear XLIFF para generar un archivo XLIFF a partir de un documento seleccionado.

source: On the left panel, click the Create XLIFF option.
es: En el panel izquierdo, haga clic en la opción Crear XLIFF .

source: Type the name and location of the document to convert to XLIFF in the Source File text box or click the Browse... button next to it to select a document from the file system.
es: Escriba el nombre y la ubicación del documento que desea convertir a XLIFF en el cuadro de texto Archivo de origen o haga clic en el botón Examinar... junto a él para seleccionar un documento del sistema de archivos.

source: If you use the Browse... button to select a file, the program tries to automatically guess its file type and character set.
es: Si utiliza el botón Examinar... para seleccionar un archivo, el programa intenta adivinar automáticamente su tipo de archivo y juego de caracteres.

source: Select the language of the document to convert using the Source Language drop-down list.
es: Seleccione el idioma del documento que desea convertir mediante la lista desplegable Idioma de origen .

source: Optionally, select the language of the translated document using the Target Language drop-down list.
es: Opcionalmente, seleccione el idioma del documento traducido mediante la lista desplegable Idioma de destino .

source: Select or adjust the type of source document using the File Type drop-down list.
es: Seleccione o ajuste el tipo de documento de origen mediante la lista desplegable Tipo de archivo .

source: Select or adjust the character set of the source document using the Character Set drop-down list.
es: Seleccione o ajuste el juego de caracteres del documento de origen mediante la lista desplegable Juego de caracteres .

source: If you are converting a DITA map and need to use a .ditaval file for conditional filtering, enter its path in the DITAVAL File text box or use the Browse... button next to it to select a file from the file system.
es: Si está convirtiendo un mapa DITA y necesita utilizar un archivo .ditaval para el filtrado condicional, introduzca su ruta en el cuadro de texto Archivo DITAVAL o utilice el botón Examinar... junto a él para seleccionar un archivo del sistema de archivos.

source: If you are converting a JSON document and need to use a custom configuration file, enter its name and location in the JSON Configuration text box or use the Browse... button next to it to select a file from the file system.
es: Si está convirtiendo un documento JSON y necesita usar un archivo de configuración personalizado, escriba su nombre y ubicación en el cuadro de texto Configuración de JSON o use el botón Examinar... junto a él para seleccionar un archivo del sistema de archivos.

source: Information on configuration files for the JSON filter is available at https://github.com/rmraya/OpenXLIFF
es: Información sobre los archivos de configuración para el filtro JSON está disponible en https://github.com/rmraya/OpenXLIFF

source: Select the Generate XLIFF 2.0 check box if you want to generate XLIFF 2.0.
es: Active la casilla Generar XLIFF 2.0 si desea generar XLIFF 2.0.

source: The program generates XLIFF 1.2 by default.
es: El programa genera XLIFF 1.2 de forma predeterminada.

source: Select the Paragraph Segmentation check box if you want source text to be segmented at paragraph level.
es: Active la casilla Segmentar por párrafos si desea que el texto de origen se segmente en el nivel de párrafo.

source: The program uses sentence-level segmentation by default. You can select the default SRX file used for segmentation in the Settings dialog.
es: El programa utiliza la segmentación a nivel de oración por defecto. Puede seleccionar el archivo SRX predeterminado utilizado para la segmentación en el cuadro de diálogo Configuración .

source: Select the Embed Skeleton option if you want the skeleton file to be inserted in the generated XLIFF.
es: Seleccione la opción Incrustar esqueleto si desea que el archivo esqueleto se inserte en el XLIFF generado.

source: The program generates a separated skeleton file in the folder defined in Settings dialog. An embedded skeleton allows merging the XLIFF file in any computer, not just the one where the XLIFF was generated.
es: El programa genera un archivo esqueleto separado en la carpeta definida en el cuadro de diálogo Configuración . Un esqueleto incrustado permite combinar el archivo XLIFF en cualquier computadora, no solo en aquella donde se generó el archivo XLIFF.

source: Click the Create XLIFF button.
es: Haga clic en el botón Crear XLIFF .

source: The program generates an XLIFF file and the corresponding skeleton.
es: El programa genera un archivo XLIFF y el esqueleto correspondiente.

source: Settings
es: Configuración

source: Use the Settings dialog to set the default languages used by the application and to configure the main XML catalog and default folder used to store skeletons when creating XLIFF files.
es: Utilice el cuadro de diálogo Configuración para establecer los idiomas predeterminados utilizados por la aplicación y para configurar el catálogo XML principal y la carpeta predeterminada utilizada para almacenar esqueletos al crear archivos XLIFF .

source: On the left panel, click the
es: En el panel izquierdo, haga clic en la opción

source: Settings option or select File Settings in main menu ( XLIFF Manager Preferences on macOS).
es: Configuración o seleccione Archivo Configuración en el menú principal ( XLIFF Manager Preferencias... en macOS).

source: The following dialog appears:
es: Aparece el siguiente cuadro de diálogo:

source: Settings Dialog
es: Cuadro de diálogo Configuración

source: Select the apropriate default source and target languages to use when creating XLIFF files.
es: Seleccione los idiomas de origen y destino predeterminados apropiados que desea utilizar al crear archivos XLIFF.

source: If you wish to use a custom catalog for XML files, enter its location in the System Catalog text box or use the corresponding Browse... button to select it from the file system.
es: Si desea utilizar un catálogo personalizado para archivos XML, introduzca su ubicación en el cuadro de texto Catálogo del sistema o utilice el botón Examinar... para seleccionarlo del sistema de archivos.

source: If you wish to change the folder where skeleton files are saved, enter the folder name in the Skeletons Folder text box or use the Browse... button to select the new location in the file system.
es: Si desea cambiar la carpeta donde se guardan los archivos esqueleto, introduzca el nombre de la carpeta en el cuadro de texto Carpeta de esqueletos o utilice el botón Examinar... para seleccionar la nueva ubicación en el sistema de archivos.

source: To use a custom SRX file when creating XLIFF files, enter its location in the Default SRX File text box or use the Browse... button to select it from the file system.
es: Para utilizar un archivo SRX personalizado al crear archivos XLIFF, introduzca su ubicación en el cuadro de texto Archivo SRX predeterminado o utilice el botón Examinar... para seleccionarlo del sistema de archivos.

source: Use the Application Language drop-down to select the language used in XLIFF Manager graphical user interface.
es: Utilice el menú desplegable Idioma de la aplicación para seleccionar el idioma utilizado en la interfaz gráfica de usuario de XLIFF Manager.

source: Changes to the application language will take effect after you restart the program.
es: Los cambios en el idioma de la aplicación surtirán efecto después de reiniciar el programa.

source: Use the Theme drop-down to select the colors used in the graphical user interface. Available options are:
es: Utilice el menú desplegable Tema para seleccionar los colores utilizados en la interfaz gráfica de usuario. Las opciones disponibles son:

source: System Default : automatically selects Dark or Light colors according to the preferences set in the operating system.
es: Predeterminado del sistema : selecciona automáticamente los colores oscuros o claros según las preferencias establecidas en el sistema operativo.

source: Dark : Uses dark background with white text.
es: Oscuro : utiliza fondo oscuro con texto blanco.

source: Light : Uses light grey background with dark text
es: Claro : utiliza fondo gris claro con texto oscuro

source: Click the Save Settings button.
es: Haga clic en el botón Guardar Configuración .

source: Merge XLIFF File
es: Combinar Archivo XLIFF

source: Use the Merge XLIFF panel to convert an XLIFF file to original format.
es: Utilice el panel Combinar XLIFF para convertir un archivo XLIFF al formato original.

source: XLIFF Manager can only merge XLIFF files that it generated or XLIFF files created with other tools that use OpenXLIFF Filters .
es: XLIFF Manager solo puede combinar archivos XLIFF que generó o archivos XLIFF creados con otras herramientas que utilizan OpenXLIFF Filters .

source: On the left panel, click on the Merge XLIFF option.
es: En el panel izquierdo, haga clic en la opción Combinar XLIFF .

source: Type the name and location of the XLIFF file to merge in the XLIFF File text box or click the Browse... button next to it to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea combinar en el cuadro de texto Archivo XLIFF o haga clic en el botón Examinar... para seleccionar un archivo XLIFF del sistema de archivos.

source: If you use the Browse... button to locate the XLIFF file, the program tries to automatically generate a suitable target file or folder.
es: Si utiliza el botón Examinar... para localizar el archivo XLIFF, el programa intenta generar automáticamente un archivo o carpeta de destino adecuado.

source: Type the name of the translated file or folder for translated documents in the Target File/Folder text box or click the Browse... button next to it to select a file or folder.
es: Escriba el nombre del archivo o carpeta para los documentos traducidos en el cuadro de texto Archivo/carpeta de destino o haga clic en el botón Examinar... junto a él para seleccionar un archivo o carpeta.

source: If the XLIFF file contains multiple documents inside, a folder is required to place all translated files in it. This is usually the case when the XLIFF was created from a DITA Map.
es: Si el archivo XLIFF contiene varios documentos en su interior, se requiere una carpeta para guardar los documentos traducidos. Este suele ser el caso cuando el archivo XLIFF se creó a partir de un mapa DITA.

source: Select the Accept Unapproved Segments checkbox if you want to consider all segments as translated, even when the approved attribute is not set to "yes".
es: Seleccione la casilla de verificación Aceptar segmentos no aprobados si desea considerar todos los segmentos como traducidos, incluso cuando el atributo " approved " no esté establecido en "yes".

source: Select the Export Approved Segments as TMX checkbox if you want to generate a TMX file from the XLIFF file.
es: Seleccione la casilla de verificación Exportar segmentos aprobados como TMX si desea generar un archivo TMX a partir del archivo XLIFF.

source: Select the Open Translated File/Folder After Merging checkbox if you want to automatically open the translated document or folder after a successful merge operation.
es: Seleccione la casilla de verificación Abrir archivo/carpeta traducido después de combinar si desea abrir automáticamente el documento o carpeta traducidos después de una operación de combinación correcta.

source: Click the Merge XLIFF button.
es: Haga clic en el botón Combinar XLIFF .

source: XLIFF Manager merges the indicated file.
es: XLIFF Manager combina el archivo indicado.

source: Copy the content of <source> elements to new or existing empty <target> elements in an XLIFF file, replacing all regular vowels with an accented version (e.g.: e => é).
es: Copie el contenido de los elementos <source> a los correspondientes elementos <target> vacíos o no traducidos de un archivo XLIFF, reemplazando todas las vocales regulares con una versión acentuada (por ejemplo: e = > é).
